modify readme file
